# -*- coding: utf-8 -*-
# ==============================================================================
# Орындаған: Орынбеков Губайдулла | Тобы: Инф-23-1
# Тапсырма 14: 14. Ең кіші мәндері бар 5 жазбаны табыңыз.
# Қолданылатын Pandas әдістері: nsmallest()
# ==============================================================================

import os
import pandas as pd

pd.set_option("display.max_columns", None)
pd.set_option("display.width", 1000)

BASE_DIR = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))
CSV_PATH = os.path.join(BASE_DIR, "students_data.csv")

myData = pd.read_csv(CSV_PATH)
num_cols = ["Курс", "Қатысу_пайызы", "Аралық_бақылау", "Емтихан_балы", "GPA", "Стипендия"]

print("=" * 80)
print('14. Ең кіші мәндері бар 5 жазбаны табыңыз.')
print("Pandas әдістері:", 'nsmallest()')
print("=" * 80 + "\n")

# --- НЕГІЗГІ КОД ---
bottom5_gpa = myData.nsmallest(5, "GPA")
print(bottom5_gpa[["Студент_ID", "Аты_жөні", "Факультет", "Мамандық", "Курс", "Қала", "Қатысу_пайызы", "Емтихан_балы", "GPA"]])

print("\n" + "-" * 80)
print("Түсіндірме:")
print("• nsmallest(5, 'GPA') — 'GPA' бағаны бойынша ең төменгі 5 жазбаны өсу ретімен табады.\nCSV бойынша талдау: Ең төменгі GPA көрсеткіші — 1.99 балл (Аяулым Мұқанова, Инженерия). Кестеден бұл студенттердің сабаққа қатысу пайызы да төмен (58%–68%) екенін байқауға болады.")
print("-" * 80)
