# -*- coding: utf-8 -*-
# ==============================================================================
# Орындаған: Орынбеков Губайдулла | Тобы: Инф-23-1
# Тапсырма 15: 15. Деректерді бір немесе бірнеше баған бойынша сұрыптаңыз.
# Қолданылатын Pandas әдістері: sort_values()
# ==============================================================================

import os
import pandas as pd

pd.set_option("display.max_columns", None)
pd.set_option("display.width", 1000)

BASE_DIR = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))
CSV_PATH = os.path.join(BASE_DIR, "students_data.csv")

myData = pd.read_csv(CSV_PATH)
num_cols = ["Курс", "Қатысу_пайызы", "Аралық_бақылау", "Емтихан_балы", "GPA", "Стипендия"]

print("=" * 80)
print('15. Деректерді бір немесе бірнеше баған бойынша сұрыптаңыз.')
print("Pandas әдістері:", 'sort_values()')
print("=" * 80 + "\n")

# --- НЕГІЗГІ КОД ---
sorted_data = myData.sort_values(by=["Факультет", "GPA"], ascending=[True, False])
print(sorted_data[["Студент_ID", "Аты_жөні", "Факультет", "Мамандық", "Курс", "Емтихан_балы", "GPA", "Стипендия"]].head(10))

print("\n" + "-" * 80)
print("Түсіндірме:")
print("• sort_values(by=['Факультет', 'GPA'], ascending=[True, False]) — кестені бірнеше баған бойынша сұрыптайды: алдымен 'Факультет' атауын әліпби ретімен (ascending=True: Ақпараттық технологиялар бірінші), ал әр факультет ішінде 'GPA' балын кему ретімен (ascending=False: ең үздігінен бастап) реттейді.\nCSV бойынша талдау: Нәтижеде Ақпараттық технологиялар факультетінің ең үздік студенттері тізім басына шықты (ең жоғары GPA = 3.90).")
print("-" * 80)
