# -*- coding: utf-8 -*-
# ==============================================================================
# Орындаған: Орынбеков Губайдулла | Тобы: Инф-23-1
# Тапсырма 4: 4. Сандық бағандардың негізгі статистикалық сипаттамаларын алыңыз.
# Қолданылатын Pandas әдістері: describe()
# ==============================================================================

import os
import pandas as pd

pd.set_option("display.max_columns", None)
pd.set_option("display.width", 1000)

BASE_DIR = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))
CSV_PATH = os.path.join(BASE_DIR, "students_data.csv")

myData = pd.read_csv(CSV_PATH)
num_cols = ["Курс", "Қатысу_пайызы", "Аралық_бақылау", "Емтихан_балы", "GPA", "Стипендия"]

print("=" * 80)
print('4. Сандық бағандардың негізгі статистикалық сипаттамаларын алыңыз.')
print("Pandas әдістері:", 'describe()')
print("=" * 80 + "\n")

# --- НЕГІЗГІ КОД ---
print(myData.describe().round(2))

print("\n" + "-" * 80)
print("Түсіндірме:")
print('• describe() әдісі кестедегі барлық сандық бағандар бойынша негізгі статистикалық көрсеткіштерді (саны — count, орташа мән — mean, стандартты ауытқу — std, минимум — min, 25%, 50% медиана, 75% квартильдер және максимум — max) автоматты түрде есептейді.\nCSV бойынша талдау: Студенттердің орташа сабаққа қатысуы — 83.59% (58%-дан 100%-ға дейін), аралық бақылаудың орташа балы — 77.72, емтиханның орташа балы — 79.45 (56-ден 100-ге дейін), ал орташа GPA — 2.98 (1.99-ден 3.96-ге дейін).')
print("-" * 80)
