# -*- coding: utf-8 -*-
# ==============================================================================
# Орындаған: Орынбеков Губайдулла | Тобы: Инф-23-1
# Тапсырма 13: 13. Таңдалған көрсеткіш бойынша ең үлкен мәндері бар 10 жазбаны табыңыз.
# Қолданылатын Pandas әдістері: nlargest()
# ==============================================================================

import os
import pandas as pd

pd.set_option("display.max_columns", None)
pd.set_option("display.width", 1000)

BASE_DIR = os.path.dirname(os.path.dirname(os.path.abspath(__file__)))
CSV_PATH = os.path.join(BASE_DIR, "students_data.csv")

myData = pd.read_csv(CSV_PATH)
num_cols = ["Курс", "Қатысу_пайызы", "Аралық_бақылау", "Емтихан_балы", "GPA", "Стипендия"]

print("=" * 80)
print('13. Таңдалған көрсеткіш бойынша ең үлкен мәндері бар 10 жазбаны табыңыз.')
print("Pandas әдістері:", 'nlargest()')
print("=" * 80 + "\n")

# --- НЕГІЗГІ КОД ---
top10_exam = myData.nlargest(10, "Емтихан_балы")
print(top10_exam[["Студент_ID", "Аты_жөні", "Факультет", "Мамандық", "Курс", "Қала", "Емтихан_балы", "GPA", "Стипендия"]])

print("\n" + "-" * 80)
print("Түсіндірме:")
print("• nlargest(10, 'Емтихан_балы') — деректерді толық сұрыптамай-ақ, 'Емтихан_балы' бағаны бойынша ең жоғары 10 жазбаны кему ретімен жылдам таңдап береді.\nCSV бойынша талдау: Емтиханнан ең жоғары балл (100 балл) жинаған ТОП-10 студенттің тізімі шығарылды. Олардың GPA көрсеткіштері де өте жоғары (3.55 – 4.00 аралығында).")
print("-" * 80)
